In [1]:
from IPython.display import display
import duckdb

# Caminho para o banco de dados DuckDB
db_path = 'D:\\GitHub\\projeto_Analytics_Engineering\\data_quality\\silver_2.duckdb'

## Tabela listings_silver:

### Colunas e tipo de colunas

In [3]:
# Conectar ao banco de dados
conn = duckdb.connect(database=db_path)

# Consulta SQL para pegar todas as colunas e seus tipos da tabela 'listings_silver'
query = """
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name = 'listings_silver'
ORDER BY ordinal_position;
"""

# Executar a consulta
result = conn.execute(query).fetchall()

# Fechar a conexão
conn.close()

# Exibir os resultados
for row in result:
    print(f"Coluna: {row[0]}, Tipo: {row[1]}")

Coluna: id, Tipo: BIGINT
Coluna: neighbourhood_cleansed, Tipo: VARCHAR
Coluna: price, Tipo: DOUBLE
Coluna: number_of_reviews, Tipo: INTEGER
Coluna: review_scores_rating, Tipo: DOUBLE

### Início da tabela

In [ ]:
# Conectar ao banco de dados
conn = duckdb.connect(database=db_path)

# Consulta SQL para pegar as primeiras 10 linhas da tabela 'listings_silver'
query = """
SELECT * FROM listings_silver
LIMIT 10;
"""

# Executar a consulta
result = conn.execute(query).fetchdf()

# Fechar a conexão
conn.close()

# Exibir os resultados
display(result)

,id,neighbourhood_cleansed,price,number_of_reviews,review_scores_rating
0,17878,Copacabana,310.0,319,4.71
1,25026,Copacabana,203.0,291,4.73
2,220377,Tijuca,220.0,5,5.00
3,35764,Copacabana,201.0,476,4.91
4,223073,Ipanema,321.0,471,4.81
5,230989,Copacabana,160.0,162,4.64
6,231105,Jacarepaguá,169.0,118,4.87
7,48305,Ipanema,2645.0,178,4.76
8,231497,Copacabana,160.0,87,4.75
9,231516,Copacabana,350.0,29,4.71

## Tabela calendar_silver:

### Colunas e tipo de colunas

In [8]:
# Conectar ao banco de dados
conn = duckdb.connect(database=db_path)

# Consulta SQL para pegar todas as colunas e seus tipos da tabela 'calendar_silver'
query = """
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name = 'calendar_silver'
ORDER BY ordinal_position;
"""

# Executar a consulta
result = conn.execute(query).fetchall()

# Fechar a conexão
conn.close()

# Exibir os resultados
for row in result:
    print(f"Coluna: {row[0]}, Tipo: {row[1]}")

Coluna: listing_id, Tipo: INTEGER
Coluna: date, Tipo: TIMESTAMP
Coluna: available, Tipo: BOOLEAN

### Início da tabela

In [5]:
# Conectar ao banco de dados
conn = duckdb.connect(database=db_path)

# Consulta SQL para pegar as primeiras 5 linhas da tabela 'calendar_silver'
query = """
SELECT * FROM calendar_silver
LIMIT 5;
"""

# Executar a consulta
result = conn.execute(query).fetchdf()

# Fechar a conexão
conn.close()

# Exibir os resultados
display(result)

   listing_id       date  available
0     4905170 2025-06-17       True
1     4905170 2025-06-20       True
2     4905170 2025-06-23       True
3     5529385 2024-10-11       True
4     5529385 2024-10-12       True